app/controllers/clients_controller.rb

INSERT INTO "clients" ("User_Name", "contact", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["User_Name", "usama"], ["contact", "12345"], ["created_at", "2023-08-30 07:46:46.408309"], ["updated_at", "2023-08-30 07:46:46.408309"]]
---
  def create
    @client = Client.new(client_params)

    respond_to do |format|
      if @client.save