app/controllers/people_controller.rb

  def create
    @people=Person.new(people_params)
    if @people.save
---
INSERT INTO "people" ("name", "age", "created_at", "updated_at", "gender", "dob") VALUES (?, ?, ?, ?, ?, ?)  [["name", "person"], ["age", 23], ["created_at", "2023-09-04 13:36:16.555269"], ["updated_at", "2023-09-04 13:36:16.555269"], ["gender", "male"], ["dob", nil]]

  def update
    @people=Person.find(params[:id])
    if @people.update(people_params)
---
UPDATE "people" SET "name" = ?, "updated_at" = ? WHERE "people"."id" = ?  [["name", "Muhammad Usama"], ["updated_at", "2023-09-04 08:34:46.833207"], ["id", 5]]

  def destroy
    @people = Person.find(params[:id])
    @people.destroy
---
DELETE FROM "people" WHERE "people"."id" = ?  [["id", 5]]